---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.StairsPath
source: html/86f6b092-6023-d978-b552-34e0e8f3444d.htm
---
# StairsPath Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.